afrab/WSim/arch/msp430/msp430_usart.c

/**
 *  \file   msp430_usart.c
 *  \brief  MSP430 USART definition 
 *  \author Antoine Fraboulet
 *  \date   2005
 **/

#include <stdio.h> 
#include <string.h>
#include <ctype.h>

#include "arch/common/hardware.h"
#include "msp430.h"

/*****************************************************/
/*****************************************************/
/*****************************************************/

#define HW_SPY_MODE 0

#if HW_SPY_MODE != 0
#define HW_SPY(x...) HW_DMSG_MCUDEV(x)
#else
#define HW_SPY(x...) do { } while (0)
#endif


/* defined in msp430_debug.h */
#if defined(DEBUG_USART)  
char *str_ssel[] = { "external UCLK", "ACLK", "SMCLK", "SMCLK" };
#endif

/*****************************************************/
/*****************************************************/
/*****************************************************/

#define TRACER_UART_IDLE     0 

#define TRACER_UART_TX_RECV  1  /* data written to TXBUF      */
#define TRACER_UART_TX_READY 2  /* data TX shifter ok         */
#define TRACER_UART_RX_RECV  3  /* data written to Rx shifter */
#define TRACER_UART_RX_READY 4  /* data written to Rx buff    */

#define TRACER_SPI_TX_RECV   6
#define TRACER_SPI_TX_READY  7
#define TRACER_SPI_RX_RECV   8
#define TRACER_SPI_RX_READY  9

#define TRACER_I2C_TX_RECV   11
#define TRACER_I2C_TX_READY  12
#define TRACER_I2C_RX_RECV   13
#define TRACER_I2C_RX_READY  14

/*****************************************************/
/*****************************************************/
/*****************************************************/





/**
 * [slau049e.pdf, page 262]
 *
 * In asynchronous mode, the USART connects the MSP430 to an external
 * system via two external pins, URXD and UTXD. UART mode is selected when
 * the SYNC bit is cleared.
 *
 *
 *   UART mode features include:
 *
 * - 7- or 8-bit data with odd, even, or non-parity
 * - Independent transmit and receive shift registers
 * - Separate transmit and receive buffer registers
 * - LSB-first data transmit and receive
 * - Built-in idle-line and address-bit communication protocols for
 *    multiprocessor systems
 * - Receiver start-edge detection for auto-wake up from LPMx modes
 * - Programmable baud rate with modulation for fractional baud rate support
 * - Status flags for error detection and suppression and address detection
 * - Independent interrupt capability for receive and transmit
 **/

/**
 * In synchronous mode, the USART connects the MSP430 to an external
 * system via three or four pins: SIMO, SOMI, UCLK, and STE. SPI mode is
 * selected when the SYNC bit is set and the I2C bit is cleared.
 *
 * SPI mode features include:
 * - 7- or 8-bit data length
 * - 3-pin and 4-pin SPI operation
 * - Master or slave modes
 * - Independent transmit and receive shift registers
 * - Separate transmit and receive buffer registers
 * - Selectable UCLK polarity and phase control
 * - Programmable UCLK frequency in master mode
 * - Independent interrupt capability for receive and transmit
 * Figure 14-1 shows the USART when configured for SPI mode.
 **/

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define USART_RESET(USART)                                                    \
  MCU.USART.uxrxbuf            = 0;					      \
  MCU.USART.uxrxbuf_full       = 0;                                           \
  MCU.USART.uxrx_shift_buf     = 0;                                           \
  MCU.USART.uxrx_shift_empty   = 1;                                           \
  MCU.USART.uxrx_shift_ready   = 0;                                           \
  MCU.USART.uxrx_shift_delay   = 0;                                           \
  MCU.USART.uxrx_slave_rx_done = 0;					      \
                                                                              \
  MCU.USART.uxtxbuf            = 0;                                           \
  MCU.USART.uxtxbuf_full       = 0;                                           \
  MCU.USART.uxtx_full_delay    = 0;                                           \
  MCU.USART.uxtctl.b.txept     = 1;                                           \
  MCU.USART.uxtx_shift_buf     = 0;                                           \
  MCU.USART.uxtx_shift_empty   = 1;                                           \
  MCU.USART.uxtx_shift_ready   = 0;                                           \
  MCU.USART.uxtx_shift_delay   = 0;                                           \
                                                                              \
  MCU.USART.mode             = USART_MODE_UART;

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*                                                                           */
/*                                                                           */
/* SPI mode                                                                  */
/*                                                                           */
/*                                                                           */
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/

/*****************************/                                     
/**** SPI transmit enable ****/                                     
/* 
   TODO: SPI à vérifer : baisser urxex pendant que rx shift != empty arrête réception ?? 
   TODO: AFR: check that SPI SPEED is at most UBRCLK/2
      HW_SPY("msp430:usart%d:spi:br0   %x\n",NUM,MCU.USART.uxbr0);
      HW_SPY("msp430:usart%d:spi:br1   %x\n",NUM,MCU.USART.uxbr1);
*/

#define SPI_MODE_UPDATE(USART,NUM,ME,IE,IFG)                                  \
do {                                                                          \
  if (MCU.sfr.ME.b.urxe##NUM == 1)   /* b.spie device ON */                   \
    {                                                                         \
      /* Tx buffer */							\
      if (MCU.USART.uxtxbuf_full == 1)                                        \
        {                                                                     \
	  if (MCU.USART.uxtx_shift_empty == 1 &&			      \
	      (MCU.USART.uxctl.b.mm ==1 || MCU.USART.uxrx_slave_rx_done == 1))\
	    /* if SPI in slave mode, tx is done immediately as delay has  */  \
	    /* been taken into account by the SPI master device on rx */      \
            {                                                                 \
               MCU.USART.uxtx_shift_buf   = MCU.USART.uxtxbuf;                \
               MCU.USART.uxtxbuf_full     = 0;                                \
               MCU.USART.uxtx_full_delay  = 0;                                \
               MCU.USART.uxtx_shift_empty = 0;                                \
               MCU.USART.uxtx_shift_ready = 0;                                \
	       if (MCU.USART.uxctl.b.mm == 1) /* master */		      \
		 {							      \
		   MCU.USART.uxtx_shift_delay = 7+MCU.USART.uxctl.b.charb;    \
		 }							      \
	       else							      \
		 {							      \
		   MCU.USART.uxtx_shift_delay = 0;			      \
		   MCU.USART.uxrx_slave_rx_done = 0;			      \
		 }							      \
               MCU.sfr.IFG.b.utxifg##NUM  = 1;                                \
               if (MCU.sfr.IE.b.utxie##NUM)                                   \
                 {                                                            \
                    msp430_interrupt_set(INTR_USART##NUM##_TX);               \
                 }                                                            \
               HW_DMSG_USART("msp430:usart%d: SPI tx buf -> shifter (%d)\n",  \
			     NUM,MCU.USART.uxtx_shift_delay);		      \
	       HW_SPY("msp430:usart%d: SPI send (0x%x,%c) at 0x%04x\n",NUM,   \
		       MCU.USART.uxtxbuf, isprint(MCU.USART.uxtxbuf) ?	      \
		       MCU.USART.uxtxbuf : '.', mcu_get_pc());		      \
            }                                                                 \
         } /* uxtfubuf_full */                                                \
                                                                              \
      /* TX shift register */                                                 \
      if (MCU.USART.uxtx_shift_empty == 0)                                    \
         {                                                                    \
            switch (MCU.USART.uxtctl.b.ssel)                                  \
              {                                                               \
            case 0:                                                           \
              ERROR("msp430:usart%d: SPI TX clk = UCLK, not supported\n",NUM);\
              MCU.USART.uxtx_shift_delay = 0;                                 \
              break;                                                          \
            case 1:                                                           \
              MCU.USART.uxtx_shift_delay -= MCU_CLOCK.ACLK_increment;         \
	      HW_DMSG_USART("msp430:usart%d, aclk SPI delay %d\n",NUM,        \
                              NUM,MCU.USART.uxtx_shift_delay);                \
              break;                                                          \
            case 2:                                                           \
            case 3:                                                           \
              MCU.USART.uxtx_shift_delay -= MCU_CLOCK.SMCLK_increment;        \
	      /*HW_DMSG_USART("msp430:usart%d, smclk SPI delay %d\n",*/	\
	      /*  NUM,MCU.USART.uxtx_shift_delay);	*/		\
              break;                                                          \
              }                                                               \
                                                                              \
            if (MCU.USART.uxtx_shift_delay <= 0)                              \
              {                                                               \
               /*tracer_event_record(TRACER_USART##NUM,TRACER_SPI_TX_READY);*/\
                 MCU.USART.uxtx_shift_ready = 1;                              \
                 MCU.USART.uxtctl.b.txept   = 1;                              \
              }                                                               \
         } /* tx_shift_empty */                                               \
                                                                              \
      /* RX shift register */                                                 \
      if (MCU.USART.uxrx_shift_empty == 0)                                    \
        {                                                                     \
          if (MCU.USART.uxctl.b.listen == 1)                                  \
            {                                                                 \
               ERROR("msp430:usart%d: SPI listen mode not supported\n",NUM);  \
            }                                                                 \
                                                                              \
          switch (MCU.USART.uxtctl.b.ssel)                                    \
            {                                                                 \
          case 0:                                                             \
            ERROR("msp430:usart%d: SPI RX clk = UCLK not supported\n",NUM);   \
            MCU.USART.uxrx_shift_delay = 0;                                   \
            break;                                                            \
          case 1:                                                             \
            MCU.USART.uxrx_shift_delay -= MCU_CLOCK.ACLK_increment;           \
            break;                                                            \
          case 2:                                                             \
          case 3:                                                             \
            MCU.USART.uxrx_shift_delay -= MCU_CLOCK.SMCLK_increment;          \
            break;                                                            \
            }                                                                 \
                                                                              \
          if (MCU.USART.uxrx_shift_delay <= 0)                                \
            {                                                                 \
               MCU.USART.uxrx_shift_ready = 1;                                \
            }                                                                 \
        } /* shift empty */                                                   \
                                                                              \
      if (MCU.USART.uxrx_shift_ready == 1)                                    \
        {                                                                     \
          if (MCU.USART.uxrxbuf_full == 1)                                    \
            {                                                                 \
               MCU.USART.uxrctl.b.oe = 1;                                     \
               /* sends out lots of debug message for burst writes */         \
               /* ERROR("msp430:usart%d: SPI Rx Overrun (0x%x,%c)\n",NUM, */  \
	       /*	     MCU.USART.uxrx_shift_buf,		*/	\
	       /*   isgraph(MCU.USART.uxrx_shift_buf) ?	*/		\
	       /*   MCU.USART.uxrx_shift_buf : '.');	*/		\
            }                                                                 \
          /*tracer_event_record(TRACER_USART##NUM, TRACER_SPI_RX_READY);*/    \
          MCU.USART.uxrxbuf          = MCU.USART.uxrx_shift_buf;              \
          MCU.USART.uxrxbuf_full     = 1;                                     \
          MCU.USART.uxrx_shift_ready = 0;                                     \
          MCU.USART.uxrx_shift_empty = 1;                                     \
          HW_DMSG_USART("msp430:usart%d: SPI rx shifter -> rx buf\n",NUM);    \
	  HW_SPY("msp430:usart%d: SPI receive (0x%x,%c)\n",NUM,	              \
                  MCU.USART.uxrxbuf, isgraph(MCU.USART.uxrxbuf) ?	      \
                  MCU.USART.uxrxbuf : '.');	                              \
          MCU.sfr.IFG.b.urxifg##NUM  = 1;                                     \
          if (MCU.sfr.IE.b.urxie##NUM)                                        \
            {                                                                 \
               msp430_interrupt_set(INTR_USART##NUM##_RX);                    \
            }                                                                 \
        } /* shift ready */                                                   \
    } /* urxe. spie */                                                        \
} while (0)
/**** end SPI transmit    ****/                                     
/*****************************/                                     


/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*                                                                           */
/*                                                                           */
/* UART mode                                                                 */
/*                                                                           */
/*                                                                           */
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/

static inline int32_t USART_MODE_UPDATE_BITCLK(int ssel, int num)
{
  int32_t res = 0;
  switch (ssel)
    {
    case 0:
      ERROR("msp430:usart%d: UART clk = UCLK\n",num);
      res = 0;
      break;
    case 1:
      res = MCU_CLOCK.ACLK_increment;
      break;
    case 2:
    case 3:
      res = MCU_CLOCK.SMCLK_increment;
      break;
    }
  return res;
}

