afrab/WSim/arch/msp430/msp430_usart.c
/*****************************/                                     
/**** UART transmit enable ****/                                     
#define USART_MODE_UPDATE(USART,NUM,ME,IE,IFG)                                \
do {                                                                          \
                                                                              \
  /* TX buffer */                                                             \
  if (MCU.sfr.ME.b.utxe##NUM == 1) /* tx enabled */                           \
    {                                                                         \
      if (MCU.USART.uxtxbuf_full == 1)                                        \
        {                                                                     \
          if ((MCU.USART.uxtx_full_delay <= 0) && (MCU.USART.uxtx_shift_empty == 1)) \
            {                                                                 \
               MCU.USART.uxtx_shift_buf   = MCU.USART.uxtxbuf;                \
               MCU.USART.uxtxbuf_full     = 0;                                \
               MCU.USART.uxtx_full_delay  = 0;                                \
               MCU.USART.uxtx_shift_empty = 0;                                \
               MCU.USART.uxtx_shift_ready = 0;                                \
               MCU.USART.uxtx_shift_delay = MCU.USART.uxbr_div;               \
               MCU.sfr.IFG.b.utxifg##NUM  = 1;                                \
               if (MCU.sfr.IE.b.utxie##NUM)                                   \
                 {                                                            \
                    msp430_interrupt_set(INTR_USART##NUM##_TX);               \
                 }                                                            \
               HW_DMSG_USART("msp430:usart%d: UART tx buf -> shifter (delay %d, val %d)\n", \
			     NUM,MCU.USART.uxtx_shift_delay, MCU.USART.uxtxbuf);            \
	       HW_SPY("msp430:usart%d: UART send (0x%x,%c)\n",NUM,            \
                  MCU.USART.uxtxbuf, isgraph(MCU.USART.uxtxbuf) ?             \
                  MCU.USART.uxtxbuf : '.');                                   \
            }                                                                 \
          else                                                                \
            {                                                                 \
              /* dec uxtx_full_delay */                                       \
              MCU.USART.uxtx_full_delay -=                                    \
                       USART_MODE_UPDATE_BITCLK(MCU.USART.uxtctl.b.ssel,NUM); \
            }                                                                 \
         } /* uxtfubuf_full */                                                \
    } /* tx enabled */                                                        \
                                                                              \
                                                                              \
  /* TX shift register */                                                     \
  /* transmit is flushed even if me.uxte is disabled */                       \
  if (MCU.USART.uxtx_shift_empty == 0)                                        \
    {                                                                         \
      MCU.USART.uxtx_shift_delay -=                                           \
            USART_MODE_UPDATE_BITCLK(MCU.USART.uxtctl.b.ssel,NUM);            \
      if (MCU.USART.uxtx_shift_delay <= 0)                                    \
	{                                                                     \
	  /*tracer_event_record(TRACER_USART##NUM,TRACER_UART_TX_READY);*/    \
	  MCU.USART.uxtx_shift_ready = 1;                                     \
	  MCU.USART.uxtctl.b.txept   = 1;                                     \
	}								      \
    } /* tx_shift_empty */						      \
                                                                              \
                                                                              \
  /* RX shift register */                                                     \
  /* finish receive even if me.uxrx is off */                                 \
  /* if (MCU.sfr.ME.b.urxe##NUM == 1) */                                      \
    {                                                                         \
      /* RX shift register */                                                 \
      if (MCU.USART.uxrx_shift_empty == 0)                                    \
        {                                                                     \
          if (MCU.USART.uxctl.b.listen == 1)                                  \
            {                                                                 \
               ERROR("msp430:usart%d: UART listen mode not supported\n",NUM); \
            }                                                                 \
								              \
	  MCU.USART.uxrx_shift_delay -=					      \
	    USART_MODE_UPDATE_BITCLK(MCU.USART.uxtctl.b.ssel,NUM);	      \
                                                                              \
          if (MCU.USART.uxrx_shift_delay <= 0)                                \
            {                                                                 \
               MCU.USART.uxrx_shift_ready = 1;                                \
            }                                                                 \
        } /* shift empty */                                                   \
                                                                              \
                                                                              \
      if (MCU.USART.uxrx_shift_ready == 1)                                    \
        {                                                                     \
          if (MCU.USART.uxrxbuf_full == 1)                                    \
            {                                                                 \
               MCU.USART.uxrctl.b.oe = 1;                                     \
               ERROR("msp430:usart%d: UART Rx Overrun (0x%x,%c)\n",NUM,       \
		     MCU.USART.uxrx_shift_buf,                                \
                     isgraph(MCU.USART.uxrx_shift_buf) ?                      \
                     MCU.USART.uxrx_shift_buf : '.');                         \
            }                                                                 \
          /*tracer_event_record(TRACER_USART##NUM,TRACER_UART_RX_READY);*/    \
          MCU.USART.uxrxbuf          = MCU.USART.uxrx_shift_buf;              \
          MCU.USART.uxrxbuf_full     = 1;                                     \
          MCU.USART.uxrx_shift_ready = 0;                                     \
          MCU.USART.uxrx_shift_empty = 1;                                     \
          HW_DMSG_USART("msp430:usart%d: UART rx shifter -> rx buf\n",NUM);   \
	  HW_SPY("msp430:usart%d: UART receive (0x%x,%c)\n",NUM,              \
                  MCU.USART.uxrxbuf, isgraph(MCU.USART.uxrxbuf) ?             \
                  MCU.USART.uxrxbuf : '.');                                   \
          MCU.sfr.IFG.b.urxifg##NUM  = 1;                                     \
          if (MCU.sfr.IE.b.urxie##NUM)                                        \
            {                                                                 \
               msp430_interrupt_set(INTR_USART##NUM##_RX);                    \
            }                                                                 \
        } /* shift ready */                                                   \
    } /* me.urxe */                                                           \
} while (0)
/**** end UART transmit    ****/                                     
/*****************************/                                     

/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*                                                                           */
/*                                                                           */
/*                                                                           */
/*                                                                           */
/*                                                                           */
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/
/*****************************************************************************/

#define USART_UPDATE(USART,NUM,ME,IE,IFG)                                     \
  switch (MCU.USART.mode)                                                     \
    {                                                                         \
  case USART_MODE_UART:                                                       \
    USART_MODE_UPDATE(USART,NUM,ME,IE,IFG);                                   \
    break;                                                                    \
  case USART_MODE_SPI:                                                        \
    SPI_MODE_UPDATE(USART,NUM,ME,IE,IFG);                                     \
    break;                                                                    \
  case USART_MODE_I2C:                                                        \
    ERROR("msp430:usart%d: I2C not implemented\n",NUM);                       \
    break;                                                                    \
    }


