afrab/WSim/arch/msp430/msp430_usart.c
/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define USART_READ(USART,NUM,IE,IFG)                                          \
  int8_t res;                                                                 \
  switch (addr)                                                               \
    {                                                                         \
    case U##NUM##CTL        :                                                 \
      res = MCU.USART.uxctl.s;                                                \
      HW_DMSG_USART("msp430:usart%d: read uxctl = 0x%02x\n",NUM,res & 0xff);  \
      break;                                                                  \
    case U##NUM##TCTL       :                                                 \
      res = MCU.USART.uxtctl.s;                                               \
      HW_DMSG_USART("msp430:usart%d: read uxtctl = 0x%02x [PC=0x%04x]\n",NUM,res & 0xff, mcu_get_pc()); \
      break;                                                                  \
    case U##NUM##RCTL       :                                                 \
      res = MCU.USART.uxrctl.s;                                               \
      HW_DMSG_USART("msp430:usart%d: read uxrctl = 0x%02x\n",NUM,res & 0xff); \
      break;                                                                  \
    case U##NUM##MCTL       :                                                 \
      res = MCU.USART.uxmctl;                                                 \
      HW_DMSG_USART("msp430:usart%d: read uxmctl = 0x%02x\n",NUM,res & 0xff); \
      break;                                                                  \
    case U##NUM##BR0        :                                                 \
      res = MCU.USART.uxbr0;                                                  \
      HW_DMSG_USART("msp430:usart%d: read uxbr0 = 0x%02x\n",NUM,res & 0xff);  \
      break;                                                                  \
    case U##NUM##BR1        :                                                 \
      res = MCU.USART.uxbr1;                                                  \
      HW_DMSG_USART("msp430:usart%d: read uxbr1 = 0x%02x\n",NUM,res & 0xff);  \
      break;                                                                  \
    case U##NUM##RXBUF      :                                                 \
      res = MCU.USART.uxrxbuf;                                                \
      MCU.sfr.IFG.b.urxifg##NUM = 0;                                          \
      MCU.USART.uxrxbuf_full    = 0;                                          \
      TRACER_TRACE_USART##NUM(TRACER_UART_IDLE);                              \
      switch (MCU.USART.mode) {                                               \
      case USART_MODE_UART:                                                   \
        break;                                                                \
      case USART_MODE_SPI:                                                    \
        etracer_slot_event(ETRACER_PER_ID_MCU_SPI + NUM,                      \
                           ETRACER_PER_EVT_READ_COMMAND,                      \
                          (ETRACER_PER_ARG_WR_DST_FIFO | ETRACER_ACCESS_LVL_BUS), 0);\
        break;                                                                \
      case USART_MODE_I2C:                                                    \
        break;                                                                \
      }                                                                       \
      MCU.USART.uxrctl.b.oe     = 0;                                          \
      HW_DMSG_USART("msp430:usart%d: read uxrxbuf = 0x%02x\n",NUM,res & 0xff);\
      break;                                                                  \
    case U##NUM##TXBUF      :                                                 \
      res = MCU.USART.uxtxbuf;                                                \
      MCU.sfr.IFG.b.utxifg##NUM = 0;                                          \
      HW_DMSG_USART("msp430:usart%d: read uxtxifg = 0x%02x\n",NUM,res & 0xff);\
      break;                                                                  \
    default                 :                                                 \
      res = 0;                                                                \
      ERROR("msp430:usart%d: read bad address 0x%04x\n",NUM,addr);            \
      break;                                                                  \
    }                                                                         \
  return res;                                                                 

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#if defined(HW_SPY_MODE)
#define HW_SPY_PRINT_CONFIG(USART,NUM)					      \
  HW_SPY("msp430:usart%d:spi: ============\n",NUM);                           \
  HW_SPY("msp430:usart%d:spi:ctl   %x\n",NUM,MCU.USART.uxctl.s);              \
  HW_SPY("msp430:usart%d:spi:tctl  %x\n",NUM,MCU.USART.uxtctl.s);             \
  HW_SPY("msp430:usart%d:spi:rctl  %x\n",NUM,MCU.USART.uxrctl.s);             \
  HW_SPY("msp430:usart%d:spi:br0   %x\n",NUM,MCU.USART.uxbr0);                \
  HW_SPY("msp430:usart%d:spi:br1   %x\n",NUM,MCU.USART.uxbr1);                \
  HW_SPY("msp430:usart%d:spi:mctl  %x\n",NUM,MCU.USART.uxmctl);               \
  HW_SPY("msp430:usart%d:spi:rxbuf %x\n",NUM,MCU.USART.uxrxbuf);              \
  HW_SPY("msp430:usart%d:spi:txbuf %x\n",NUM,MCU.USART.uxtxbuf);              \
  HW_SPY("msp430:usart%d:spi: ============\n",NUM);                            
#else                                                                         
#define HW_SPY_PRINT_CONFIG(USART,NUM) do {} while(0)
#endif

#define msp430_usart_set_baudrate(NUM,USART)                                  \
{                                                                             \
  USART.uxbr_div = ((USART.uxbr1 << 8 | USART.uxbr0) / 2) * (USART.uxctl.b.charb + 7); \
  HW_DMSG_USART("msp430:usart%d:   baudrate : uxbr = %d, div = %d\n",      \
		NUM,((USART.uxbr1 << 8 | USART.uxbr0) / 2), USART.uxbr_div);   \
}

