afrab/WSim/arch/msp430/msp430_usart.c
#define USART_WRITE(USART,NUM,IE,IFG)                                         \
  switch (addr)                                                               \
    {                                                                         \
    case U##NUM##CTL        :                                                 \
      {                                                                       \
	union {                                                               \
	  struct uxctl_t      b;                                              \
	  struct uxctl_spi_t  b_spi;                                          \
	  uint8_t             s;                                              \
	} ctl;                                                                \
	                                                                      \
	ctl.s = val;                                                          \
	HW_DMSG_USART("msp430:usart%d: write uxctl = 0x%02x\n",NUM,val & 0xff);                    \
	/* HW_DMSG_USART("msp430:usart%d:   swrst  = %d\n",NUM, ctl.b.swrst); */ \
	/* HW_DMSG_USART("msp430:usart%d:   sync   = %d\n",NUM, ctl.b.sync);  */ \
	/* HW_DMSG_USART("msp430:usart%d:   mm     = %d (multi master)\n",NUM, ctl.b.mm); */  \
	/* HW_DMSG_USART("msp430:usart%d:   listen = %d (loopback)\n",NUM, ctl.b.listen); */  \
	/* HW_DMSG_USART("msp430:usart%d:   spb    = %d (0:1 stop, 1:2 stop bits)\n",NUM, ctl.b.spb); */  \
	/* ctl.b.sync == 0                         : UART */                  \
	/* ctl.b.sync == 1, ctl.b.spb == 0         : SPI  */                  \
	/* ctl.b.sync == 1, ctl.b.spb == 1         : I2C  */                  \
        if (ctl.b.sync == 0)                                                  \
          {                                                                   \
            MCU.USART.mode = USART_MODE_UART;                                 \
            if (MCU.USART.uxctl.b.sync == 1)                                  \
              {                                                               \
                HW_SPY("msp430:usart%d:   switch to USART mode\n",NUM);       \
                HW_DMSG_USART("msp430:usart%d:   mode   = USART\n",NUM);      \
              }                                                               \
          }                                                                   \
        else /* ctl.b.sync == 1 */                                            \
          {                                                                   \
            if (ctl.b.spb == 0)                                               \
              {                                                               \
                MCU.USART.mode = USART_MODE_SPI;                              \
                if (MCU.USART.uxctl.b.sync == 0)                              \
                  {                                                           \
                     HW_SPY("msp430:usart%d:   switch to SPI mode\n",NUM);    \
                     HW_SPY_PRINT_CONFIG(USART,NUM);                          \
                     HW_DMSG_USART("msp430:usart%d:   mode   = SPI\n",NUM);   \
                  }                                                           \
              }                                                               \
            else /* ctl.b.spb == 1 */                                         \
              {                                                               \
		/* #if defined(__msp430_have_usart0_with_i2c) */              \
                if (NUM == 0) /* only uart0 can have i2c */                   \
		  {                                                           \
                     MCU.USART.mode = USART_MODE_I2C;                         \
                     ERROR("msp430:usart%d:   i2c mode is not implemented\n",NUM);                 \
                     HW_DMSG_USART("msp430:usart%d:   mode   = I2C (not supported)\n",NUM);        \
                  }                                                           \
                else                                                          \
                 {                                                            \
		     ERROR("msp430:usart%d:   i2c does not exist on USART%d\n",NUM,NUM);           \
		 }							      \
              }                                                               \
          }                                                                   \
                                                                              \
	HW_DMSG_USART("msp430:usart%d:   length = %d bits\n",NUM,             \
                                           (ctl.b.charb == 1) ? 8:7);         \
                                                                              \
        if ((ctl.b.swrst == 1) && (MCU.USART.uxctl.b.swrst == 0))             \
          {                                                                   \
             /* reset  URXIEx, UTXIEx, URXIFGx, OE, and FE bits */            \
             /* set UTXIFGx flag                                */            \
             HW_DMSG_USART("msp430:usart%d:   swrst  = 1, reset flags\n",     \
                            NUM);                                             \
             MCU.sfr.IE.b.urxie##NUM     = 0;                                 \
             MCU.sfr.IE.b.utxie##NUM     = 0;                                 \
             MCU.sfr.IFG.b.urxifg##NUM   = 0;                                 \
             MCU.USART.uxrctl.b.oe       = 0;                                 \
             MCU.USART.uxrctl.b.fe       = 0;                                 \
             MCU.sfr.IFG.b.utxifg##NUM   = 1;                                 \
             /* finishing current transaction */                              \
             MCU.USART.uxtxbuf_full      = 0;                                 \
             MCU.USART.uxtx_full_delay   = 0;                                 \
             MCU.USART.uxtctl.b.txept    = 1;                                 \
             MCU.USART.uxtx_shift_empty  = 1;                                 \
             MCU.USART.uxrxbuf_full      = 0;                                 \
             MCU.USART.uxrx_shift_empty  = 1;                                 \
          }                                                                   \
	MCU.USART.uxctl.s = val;                                              \
        if (ctl.b.charb != MCU.USART.uxctl.b.charb) {                         \
           msp430_usart_set_baudrate(NUM, MCU.USART);                         \
        }                                                                     \
      }                                                                       \
      break;                                                                  \
                                                                              \
    case U##NUM##TCTL       :  /* transmit ctrl register */                   \
      {                                                                       \
	union {                                                               \
	  struct uxtctl_t     b;                                              \
	  struct uxtctl_spi_t b_spi;                                          \
	  uint8_t             s;                                              \
	} tctl;                                                               \
        tctl.s = val;                                                         \
        HW_DMSG_USART("msp430:usart%d: write uxtctl = 0x%02x\n",NUM,val & 0xff);                   \
        HW_DMSG_USART("msp430:usart%d:   spi:ckph    = %d (clock phase)\n",NUM,tctl.b.ckph);       \
        HW_DMSG_USART("msp430:usart%d:   ckpl        = %d (clock polarity)\n",NUM,tctl.b.ckpl);    \
        HW_DMSG_USART("msp430:usart%d:   ssel        = %d (%s)\n",            \
                      NUM,tctl.b.ssel,str_ssel[tctl.b.ssel]);                 \
        HW_DMSG_USART("msp430:usart%d:   uart:urxse  = %d (recv start edge)\n",NUM,tctl.b.urxse);  \
        HW_DMSG_USART("msp430:usart%d:   uart:txwake = %d (0:data 1:addr)\n",NUM,tctl.b.txwake);   \
        if (tctl.b.txwake == 1) {                                             \
           MCU.USART.next_tx_type = usart_data;                               \
        } else {                                                              \
           MCU.USART.next_tx_type = usart_address;                            \
        }                                                                     \
        HW_DMSG_USART("msp430:usart%d:   spi:stc     = %d (4pin spi, 3pin spi)\n",NUM,tctl.b.stc); \
        HW_DMSG_USART("msp430:usart%d:   txept       = %d (tx empty flag)\n",NUM,tctl.b.txept);    \
	MCU.USART.uxtctl.s = val;                                             \
        if (tctl.b.ssel != MCU.USART.uxtctl.b.ssel)                           \
          {                                                                   \
             msp430_usart_set_baudrate(NUM, MCU.USART);                       \
          }                                                                   \
      }                                                                       \
      break;                                                                  \
    case U##NUM##RCTL       : /* receive ctrl register */                     \
      HW_DMSG_USART("msp430:usart%d: write uxrctl = 0x%02x\n",NUM,val & 0xff);\
      MCU.USART.uxrctl.s = val;                                               \
      break;                                                                  \
    case U##NUM##MCTL       : /* modulation ctrl register */                  \
      HW_DMSG_USART("msp430:usart%d: write uxmctl = 0x%02x\n",NUM,val & 0xff);\
      MCU.USART.uxmctl = val;                                                 \
      msp430_usart_set_baudrate(NUM, MCU.USART);                              \
      break;                                                                  \
    case U##NUM##BR0        : /* baud rate ctrl register 0 */                 \
      HW_DMSG_USART("msp430:usart%d: write uxbr0  = 0x%02x\n",NUM,val & 0xff);\
      MCU.USART.uxbr0 = val;                                                  \
      msp430_usart_set_baudrate(NUM, MCU.USART);                              \
      break;                                                                  \
    case U##NUM##BR1        : /* baud rate ctrl register 1 */                 \
      HW_DMSG_USART("msp430:usart%d: write uxbr1  = 0x%02x\n",NUM,val & 0xff);\
      MCU.USART.uxbr1 = val;                                                  \
      msp430_usart_set_baudrate(NUM, MCU.USART);                              \
      break;                                                                  \
    case U##NUM##RXBUF      :                                                 \
      ERROR("msp430:usart%d: writing to read only register RXBUFF\n",NUM);    \
      break;                                                                  \
    case U##NUM##TXBUF      :                                                 \
      HW_DMSG_USART("msp430:usart%d: write uxtxbuf  = 0x%02x [PC=0x%04x]\n",NUM,val & 0xff, \
		    mcu_get_pc());					\
      if ((MCU.USART.uxtxbuf_full == 1) && (MCU.USART.uxctl.b.mm == 1)) /* master */ \
        {                                                                     \
          WARNING("msp430:usart%d:    overwriting tx buffer with [0x%02x]\n", \
                NUM,val & 0xff);                                              \
        }                                                                     \
      MCU.USART.uxtxbuf            = val;                                     \
      MCU.USART.uxtxbuf_full       = 1;                                       \
      MCU.USART.uxtx_full_delay    = 1; /* go to shifter after xx BITCLK */   \
      MCU.USART.uxtctl.b.txept     = 0;                                       \
      MCU.sfr.IFG.b.utxifg##NUM    = 0;                                       \
      switch (MCU.USART.mode) {                                               \
      case USART_MODE_UART:                                                   \
        TRACER_TRACE_USART##NUM(TRACER_UART_TX_RECV);			      \
        /* can be a dupe from the platform file */                            \
        etracer_slot_event(ETRACER_PER_ID_MCU_USART + NUM,                    \
                           ETRACER_PER_EVT_WRITE_COMMAND,                     \
                           ETRACER_PER_ARG_WR_DST_FIFO, 0);                   \
        break;                                                                \
      case USART_MODE_SPI:                                                    \
        TRACER_TRACE_USART##NUM(TRACER_SPI_TX_RECV);  			      \
        etracer_slot_event(ETRACER_PER_ID_MCU_SPI + NUM,                      \
                           ETRACER_PER_EVT_WRITE_COMMAND,                     \
                           ETRACER_PER_ARG_WR_DST_FIFO | ETRACER_ACCESS_LVL_BUS, 0); \
        HW_SPY("msp430:usart%d:spi: write byte %x\n",NUM,val & 0xff);         \
        HW_SPY_PRINT_CONFIG(USART,NUM);                                       \
        break;                                                                \
      case USART_MODE_I2C:                                                    \
        TRACER_TRACE_USART##NUM(TRACER_I2C_TX_RECV);			      \
        break;                                                                \
      }                                                                       \
      break;                                                                  \
    }  /* switch */                                                           

