afrab/WSim/arch/msp430/msp430_usart.c
/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#define USART_CHKIFG(NUM,IE,IFG)                                              \
   int ret = 0;                                                               \
   if (MCU.sfr.IFG.b.utxifg##NUM && MCU.sfr.IE.b.utxie##NUM)                  \
     {                                                                        \
        msp430_interrupt_set(INTR_USART##NUM##_TX);                           \
        ret = 1;                                                              \
     }                                                                        \
   if (MCU.sfr.IFG.b.urxifg##NUM && MCU.sfr.IE.b.urxie##NUM)                  \
     {                                                                        \
        msp430_interrupt_set(INTR_USART##NUM##_RX);                           \
        ret = 1;                                                              \
     }                                                                        \
   return ret;

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

/* read from external peripherals */

#define SPI_READ(USART,NUM,ME,val)                                            \
  if (MCU.USART.mode == USART_MODE_SPI)                                       \
    {                                                                         \
      if (MCU.USART.uxtx_shift_ready == 1)                                    \
	{                                                                     \
	  val = MCU.USART.uxtx_shift_buf;                                     \
	  MCU.USART.uxtx_shift_ready = 0;                                     \
	  MCU.USART.uxtx_shift_empty = 1;                                     \
          TRACER_TRACE_USART##NUM(TRACER_UART_IDLE);			      \
          etracer_slot_event(ETRACER_PER_ID_MCU_SPI + NUM,                    \
                             ETRACER_PER_EVT_WRITE_COMMAND,                   \
                            (ETRACER_PER_ARG_WR_SRC_FIFO | (ETRACER_ACCESS_LVL_SPI + NUM)), 0); \
	  return 1;                                                           \
	}                                                                     \
    }                                                                         \
  return 0;


#define SPI_WRITE_OK(USART)                                                   \
  (MCU.USART.mode == USART_MODE_SPI && MCU.USART.uxrx_shift_empty == 1)      

/* usart SPI write from peripherals */
#if 0
// removed from RX, a byte is received while TX
      if (MCU.USART.uxrx_shift_empty != 1)                                    \
	{                                                                     \
	  ERROR("msp430:usart%d: SPI rx value while rx shift not empty (%d)\n", \
	          NUM,MCU.USART.uxrx_shift_delay);                            \
	}                                                                     \
      else                                                                    \

#endif

#define SPI_WRITE(USART,NUM,ME,val)                                           \
  if (MCU.sfr.ME.b.urxe##NUM == 1)  /* verif Digi IO _SEL & _DIR */           \
    {                                                                         \
        {                                                                     \
	  TRACER_TRACE_USART##NUM(TRACER_SPI_RX_RECV);			      \
          MCU.USART.uxrx_shift_buf   = val;                                   \
          MCU.USART.uxrx_shift_empty = 0;                                     \
          MCU.USART.uxrx_shift_ready = 0;				      \
	  /* no delay, as delay has been taken into account during tx*/	      \
          MCU.USART.uxrx_shift_delay = 0;				      \
	  if (MCU.USART.uxctl.b.mm == 0)				      \
	    MCU.USART.uxrx_slave_rx_done = 1;  				      \
          etracer_slot_event(ETRACER_PER_ID_MCU_SPI + NUM,                    \
                             ETRACER_PER_EVT_WRITE_COMMAND,                   \
                            (ETRACER_PER_ARG_WR_DST_FIFO | (ETRACER_ACCESS_LVL_SPI + NUM)), 0); \
          HW_DMSG_USART("msp430:usart%d: SPI rx value 0x%02x\n",NUM,val);  \
        }                                                                     \
    }                                                                         \
  else                                                                        \
    {                                                                         \
      if (MCU.USART.uxrx_shift_empty != 1)                                    \
        {                                                                     \
          HW_DMSG_USART("msp430:usart%d: SPI receive disable while shit not empty\n",NUM); \
        }                                                                     \
      ERROR("msp430:usart%d: SPI data RX but not in receive enable state\n",NUM);    \
    } 





#define UART_READ(USART,NUM,ME,val)                                           \
  if (MCU.USART.mode == USART_MODE_UART)                                      \
    {                                                                         \
      if (MCU.USART.uxtx_shift_ready == 1)                                    \
	{                                                                     \
	  val = MCU.USART.uxtx_shift_buf;                                     \
	  MCU.USART.uxtx_shift_ready = 0;                                     \
	  MCU.USART.uxtx_shift_empty = 1;                                     \
          TRACER_TRACE_USART##NUM(TRACER_UART_IDLE);			      \
	  return 1;                                                           \
	}                                                                     \
    }                                                                         \
  return 0;


#define UART_WRITE_OK(USART)                                                  \
  (MCU.USART.mode == USART_MODE_UART && MCU.USART.uxrx_shift_empty == 1)      


#define UART_WRITE(USART,NUM,ME,val)                                          \
  if (MCU.sfr.ME.b.urxe##NUM == 1)  /* verif Digi IO _SEL & _DIR */           \
    {                                                                         \
      if (MCU.USART.uxrx_shift_empty != 1)                                    \
	{                                                                     \
	  ERROR("msp430:usart%d: UART rx value while rx shift not empty (%d)\n",\
	          NUM,MCU.USART.uxrx_shift_delay);                            \
	}                                                                     \
      else                                                                    \
        {                                                                     \
	  TRACER_TRACE_USART##NUM(TRACER_UART_RX_RECV);			      \
          MCU.USART.uxrx_shift_buf   = val;                                   \
          MCU.USART.uxrx_shift_empty = 0;                                     \
          MCU.USART.uxrx_shift_ready = 0;                                     \
          MCU.USART.uxrx_shift_delay = MCU.USART.uxbr_div;                    \
          HW_DMSG_USART("msp430:usart%d: UART rx shift reg value 0x%02x\n",NUM,val);    \
        }                                                                     \
    }                                                                         \
  else                                                                        \
    {                                                                         \
      if (MCU.USART.uxrx_shift_empty != 1)                                    \
        {                                                                     \
          HW_DMSG_USART("msp430:usart%d: UART receive disable while shit not empty\n",NUM);\
        }                                                                     \
      ERROR("msp430:usart%d: UART data RX but not in receive enable state\n",NUM);   \
    } 
  
