afrab/WSim/arch/msp430/msp430_usart.c
/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#if defined(__msp430_have_usart0)
void msp430_usart0_reset()
{
  MCU.usart0.uxctl.s  = 1;    // swrst
  MCU.usart0.uxtctl.s = 1;    // txept
  MCU.usart0.uxrctl.s = 0;

  MCU.sfr.me1.s       = 0;   
  MCU.sfr.ie1.s       = 0;
  MCU.sfr.ifg1.s     |= 0x82; // utxie0 & ofie

  USART_RESET(usart0);
}

/***************************/
/********* MCU API *********/

/* update usart within internal device loop */
void msp430_usart0_update()
{
  USART_UPDATE(usart0,0,me1,ie1,ifg1)
}

/* usart read from MCU */
int8_t msp430_usart0_read(uint16_t addr)
{
  USART_READ(usart0,0,ie1,ifg1)
}

/* usart write from MCU */
void msp430_usart0_write(uint16_t addr, int8_t val)
{
  USART_WRITE(usart0,0,ie1,ifg1)
}

/* usart chk ifg for MCU interrupt */
int msp430_usart0_chkifg()
{
  USART_CHKIFG(0,ie1,ifg1)
}

/*******************************************/
/********* External Peripheral API *********/

/* usart SPI read from peripherals */
int msp430_usart0_dev_read_spi(uint8_t *val)
{
  SPI_READ(usart0,0,me1,*val)
}

/* usart SPI write from peripherals */
void msp430_usart0_dev_write_spi(uint8_t val)
{
  SPI_WRITE(usart0,0,me1,val)
}

int msp430_usart0_dev_write_spi_ok()
{
  return SPI_WRITE_OK(usart0);
}

/* usart UART read from peripherals */
int msp430_usart0_dev_read_uart(uint8_t *val)
{
  UART_READ(usart0,0,me1,*val)
}

/* usart UART write from peripherals */
void msp430_usart0_dev_write_uart(uint8_t val)
{
  UART_WRITE(usart0,0,me1,val)
}

int msp430_usart0_dev_write_uart_ok()
{
  return UART_WRITE_OK(usart0);
}
#endif

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */

#if defined(__msp430_have_usart1)
void msp430_usart1_reset()
{
  MCU.usart1.uxctl.s  = 1;     // swrst
  MCU.usart1.uxtctl.s = 1;     // txept
  MCU.usart1.uxrctl.s = 0;

  MCU.sfr.me2.s       = 0;   
  MCU.sfr.ie2.s       = 0;
  MCU.sfr.ifg2.s     |= 0x020; // utxifg1

  USART_RESET(usart1);
}

/***************************/
/********* MCU API *********/

/* update usart within internal device loop */
void msp430_usart1_update()
{
  USART_UPDATE(usart1,1,me2,ie2,ifg2)
}

/* usart read from MCU */
int8_t msp430_usart1_read(uint16_t addr)
{
  USART_READ(usart1,1,ie2,ifg2)
}

/* usart write from MCU */
void msp430_usart1_write(uint16_t addr, int8_t val)
{
  USART_WRITE(usart1,1,ie2,ifg2)
}

/* usart chk ifg for MCU interrupt */
int msp430_usart1_chkifg()
{
  USART_CHKIFG(1,ie2,ifg2)
}

/*******************************************/
/********* External Peripheral API *********/

/* usart SPI read from peripherals */
int msp430_usart1_dev_read_spi(uint8_t *val)
{
  SPI_READ(usart1,1,me2,*val)
}

/* usart SPI write from peripherals */
void msp430_usart1_dev_write_spi(uint8_t val)
{
  SPI_WRITE(usart1,1,me2,val)
}

int msp430_usart1_dev_write_spi_ok()
{
  return SPI_WRITE_OK(usart1);
}

/* usart UART read from peripherals */
int msp430_usart1_dev_read_uart(uint8_t *val)
{
  UART_READ(usart1,1,me2,*val)
}

/* usart UART write from peripherals */
void msp430_usart1_dev_write_uart(uint8_t val)
{
  UART_WRITE(usart1,1,me2,val)
}

int msp430_usart1_dev_write_uart_ok()
{
  return UART_WRITE_OK(usart1);
}
#endif

/* ************************************************** */
/* ************************************************** */
/* ************************************************** */
